I have the same issue. Can not claim devices, Operation not supported.

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of ciscodevnet/intersight from the dependency lock file
- Using previously-installed hashicorp/aws v3.31.0
- Using previously-installed ciscodevnet/intersight v1.0.2

___

resource "intersight_appliance_device_claim" "appliance_device_claim" {

  device_id ="FCH2017VXXX"
  security_token = "E50D3D159XXX"
  is_renew = false

___

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:

  + create

Terraform will perform the following actions:

  + resource "intersight_appliance_device_claim" "appliance_device_claim" {
      + account         = (known after apply)
      + class_id        = (known after apply)
      + device_id       = "FCH2017VXXX"
      + id              = (known after apply)
      + is_password_set = (known after apply)
      + is_renew        = false
      + message         = (known after apply)
      + moid            = (known after apply)
      + object_type     = (known after apply)
      + security_token  = "E50D3D159XXX"
      + status          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

intersight_appliance_device_claim.appliance_device_claim: Creating...

Error: failed while creating ApplianceDeviceClaim: undefined response type Response from endpoint: {"code":"InvalidUrl","message":"Operation not supported. Check if the API path and method are valid.","messageId":"iam_invalid_method_operation","messageParams":{},"traceId":"NBd62f270fa68824a2b4ee3d0ef3e97c0c"}
